Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/public_transport/duties_of_passengers_of_small_public_service_vehicles_spsv_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Duties of passengers of small public service vehicles
ga: Dualgais atá ar phaisinéirí feithiclí beaga seirbhíse poiblí

source: Passengers are required to obey certain rules when travelling in taxis, hackney cabs and limousines
ga: Ceanglaíonn an dlí in Éirinn ar phaisinéirí déanamh de réir rialacha áirithe agus iad ag taisteal i dtacsaithe, hacnaithe agus limisíní

source: The duty of passengers to adhere to certain rules of behaviour are set out under Section 29 of the Taxi Regulation Act 2013
ga: Leagtar amach na dualgais atá ar phaisinéirí cloí le rialacha áirithe iompair faoi Alt 29 d’Acht um Rialáil Tacsaithe 2013

source: The following is a broad overview of your duties as a passenger
ga: Is éard atá sa mhéid seo a leanas ná breac-chuntas ar do dhualgais mar phaisinéir

source: What are my responsibilities as a small public service vehicle passenger?
ga: Cad iad na freagrachtaí atá orm mar phaisinéir feithicle bige seirbhíse poiblí?

source: To co-operate with the driver’s instructions: If you are travelling in a small public service vehicle (SPSV), you are required under Section 29 of the Taxi Regulation Act 2013 to co-operate with any reasonable request by the driver
ga: Comhoibriú le treoracha an tiománaí: Má bhíonn tú ag taisteal i bhfeithiclí beaga seirbhíse poiblí (FBSP), ceanglaítear ort faoi Alt 29 den Acht um Rialáil Tacsaithe 2013 comhoibriú le haon iarratas réasúnach ón tiománaí

source: This includes wearing a seatbelt, locking the door, behaving in a civilised manner and not asking the driver to take more passengers than they are legally allowed to take
ga: San áireamh leis seo, tá crios sábhála a chaitheamh, an doras a chur faoi ghlas, tú féin a iompar ar mhodh sibhialta agus gan iarraidh ar an tiománaí níos mó paisinéirí a thógáil ná mar a cheadaítear dóibh leis an dlí

source: A driver can ask you not to enter the vehicle or to leave the vehicle if they have reason for concern
ga: Is féidir le tiománaí iarraidh ort gan teacht isteach san fheithicil nó an fheithicil a fhágáil má bhíonn údar imní acu

source: An example of this would be if the driver feels threatened by you or suspects you to be intoxicated
ga: Sampla de seo ná má airíonn an tiománaí go bhfuil tú ag bagairt air/uirthi nó má bhíonn amhras air/uirthi go bhfuil tú ar meisce

source: In this case you must obey the driver’s instructions
ga: Caithfidh tú déanamh de réir threoracha an tiománaí sa chás seo

source: Not to damage the vehicle: As a passenger, you must not cause damage to or soil the vehicle in any way
ga: Gan damáiste a dhéanamh don fheithicil: Mar phaisinéir, ní fhéadfaidh tú damáiste a dhéanamh don fheithicil nó í a shalú ar bhealach ar bith

source: This includes not eating, drinking or smoking while in the vehicle
ga: San áireamh leis seo, ní fhéadfaidh tú ithe, ól nó caitheamh tobac le linn an turais

source: A soiling charge is payable by a passenger who soils or damages the vehicle to the extent that it has to be taken out of service, or will have to be cleaned or repaired
ga: Tá táille iníoctha má dhéanann tú damáiste don fheithicil nó í a shalú ionas go mbeidh sé a thógáil amach as an tseirbhís, nó glanadh nó a dheisiú

source: Not to put the driver at risk: You must not leave any sharp objects in the vehicle that may put the driver in danger
ga: Gan an tiománaí a chur i mbaol: Ní fhéadfaidh tú aon nithe géara a fhágáil san fheithicil a d’fhéadfadh an tiománaí a chur i mbaol

source: These include syringes or sharp objects
ga: Tá steallairí nó nithe géara san áireamh leis seo

source: As a passenger of a SPSV you must not behave in any way that may put the driver at risk or compromise their safety
ga: Mar phaisinéir FBSP ní fhéadfaidh tú tú féin a iompar ar bhealach ar bith a d’fhéadfadh an tiománaí a chur i mbaol nó a sábháilteacht a chur i gcontúirt

source: To obey the rules regarding the carriage of animals: The driver of an SPSV is not required to carry an animal unless you have a disability and require the use of a guide dog or other assistance dog
ga: Déanamh de réir na rialacha maidir le hainmhithe a iompar: Níl aon oibleagáid ar an tiománaí a iompar ar ainmhí, ach amháin má tá tú faoi mhíchumas agus de dhíth ort úsáid a bhaint as madra treorach nó cúnamh madra eile

source: If you do, the driver is obliged under Regulation 39 of the Taxi Regulation (Small Public Service Vehicle) Regulations 2015 to take the dog onboard unless the driver is unable, for medical reasons, to carry a dog in their vehicle
ga: Má dhéanann tú, tá sé de dhualgas ar an tiománaí faoi Rialachán 39 de na Rialacháin um Rialáil Tacsaithe (Feithicil Beaga Seirbhíse Poiblí) 2015 a chur ar an madra ar bord. Más rud é nach féidir leis an tiománaí a dhéanamh madra i gcuid feithiclí ar chúiseanna leighis, nach bhfuil acu a

source: To pay the appropriate fare: If you are travelling in a taxi, you must pay the maximum fare as shown on the taximeter at the end of the journey (if the journey is within the taximeter area)
ga: An táille cuí a íoc: Má bhíonn tú ag taisteal i dtacsaí, caithfidh tú an uastáille a íoc de réir mar a thaispeántar ar an tacsaiméadar ag deireadh an turais (má bhíonn an turas laistigh de limistéar an tacsaiméadair)

source: If you are travelling outside the taximeter area in a taxi, or travelling in a hackney or limousine, you must agree to pay the fare before the journey begins, including any booking fee
ga: Má bhíonn tú ag taisteal lasmuigh de limistéar an tacsaiméadair i dtacsaí, nó ag taisteal i hacnaí nó i limisín, caithfidh tú aontú an táille a íoc sula dtosóidh an turas, agus aon táille áirithinte san áireamh

source: You must also be able to prove to the driver that you can afford to pay the fare or give a deposit before the journey begins
ga: Caithfidh tú a bheith in ann a chruthú don tiománaí freisin go bhfuil sé d’acmhainn agat an táille a íoc nó éarlais a thabhairt sula dtosóidh an turas

source: You can find further information on a passenger's rights and responsibilities on the National Transport Authority's transportforireland.ie website
ga: Is féidir leat tuilleadh eolais maidir le cearta agus freagrachtaí paisinéirí a aimsiú ar láithreán gréasáin an Údarás Náisiúnta Iompair transportforireland.ie
